Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionSetOfRefsChanged Property
 The set of input elements was changed and the connection has been adjusted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionSetOfRefsChanged { get; }
Public Shared ReadOnly Property StructuralConnectionSetOfRefsChanged As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionSetOfRefsChanged {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionSetOfRefsChanged : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace